<a href="https://colab.research.google.com/github/bragonzu/DATASCIENCE/blob/main/Introduction%20to%20Data%20Science%20in%20Python/Semana3/Sem3_1_MergingDataframes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import pandas as pd

#Creamos 2 Dataframes, staff y estudiantes.
staff_df=pd.DataFrame([{'Name':'Kelly', 'Role':'Director of HR'},
                       {'Name':'Sally', 'Role':'Course liasion'},
                       {'Name':'James', 'Role':'Grader'}])

#Indexamos al personal por nombre
staff_df= staff_df.set_index('Name')

#Ahora crearemos un dataframe student
student_df= pd.DataFrame([{'Name':'James','School': 'Bussiness'},
                                {'Name':'Mikys','School': 'Law'},
                                {'Name':'Sally','School': 'Engineering'}])

#Indexamos los estudiantes por nombre.
student_df=student_df.set_index('Name')

#Imprimimos las salidas de los df
print(staff_df.head())
print(student_df.head())

                 Role
Name
Kelly  Director of HR
Sally  Course liasion
James          Grader
            School
Name
James    Bussiness
Mikys          Law
Sally  Engineering

In [5]:
#Ahora haremos el merge de los 2 dataframes
#primero pasaremos del staff y luego del student
#How por defecto es interno lo que hacemos es sacarlo

pd.merge(staff_df,student_df,how='outer',left_index=True,right_index=True)

                 Role       School
Name
James          Grader    Bussiness
Kelly  Director of HR          NaN
Mikys             NaN          Law
Sally  Course liasion  Engineering

In [6]:
#Vemos que aparece miky sin rol ni Kelly sin school
pd.merge(staff_df,student_df,how='inner',left_index=True,right_index=True)

                 Role       School
Name
Sally  Course liasion  Engineering
James          Grader    Bussiness

In [7]:
pd.merge(staff_df,student_df,how='left',left_index=True,right_index=True)

                 Role       School
Name
Kelly  Director of HR          NaN
Sally  Course liasion  Engineering
James          Grader    Bussiness

In [8]:
pd.merge(staff_df,student_df,how='right',left_index=True,right_index=True)

                 Role       School
Name
James          Grader    Bussiness
Mikys             NaN          Law
Sally  Course liasion  Engineering

In [10]:
#Reseteamos los index
staff_df=staff_df.reset_index()
student_df=student_df.reset_index()

#Ahora fusionaremos con el parametro on.
pd.merge(staff_df,student_df,how='right', on='Name')

   index_x   Name            Role  index_y       School
0      2.0  James          Grader        0    Bussiness
1      NaN  Mikys             NaN        1          Law
2      1.0  Sally  Course liasion        2  Engineering

In [14]:
staff_df=pd.DataFrame([{'Name':'Kelly','Role': 'Director of HR',
                        'Location':'State Street'},
                       {'Name':'Sally','Role': 'Course liasion',
                        'Location':'Washington Avenue'},
                        {'Name':'James','Role': 'Grader',
                         'Location': 'Washington Avenue'}])


student_df=pd.DataFrame([{'Name':'James','School': 'Bussiness',
                        'Location':'1024 Billigas Avenue'},
                         {'Name':'Mike','School': 'Bussiness',
                        'Location':'1024 Billigas Avenue'},
                         {'Name':'Sallys','School': 'Engineering',
                        'Location':'52352 Dire Avenue'}])

pd.merge(staff_df,student_df, how='left', on='Name')

    Name            Role         Location_x     School            Location_y
0  Kelly  Director of HR       State Street        NaN                   NaN
1  Sally  Course liasion  Washington Avenue        NaN                   NaN
2  James          Grader  Washington Avenue  Bussiness  1024 Billigas Avenue

In [16]:
staff_df=pd.DataFrame([{'First Name':'Braham','Last Name':'Gons Zulo',
                        'Role':'Director of HR'},
                       {'First Name':'Sally','Last Name':'Brooks',
                        'Role':'Course liasion'},
                       {'First Name':'James','Last Name':'Zello',
                        'Role':'Grader'}])

student_df=pd.DataFrame([{'First Name':'James','Last Name':'Hammond',
                        'School':'Bussiness'},
                       {'First Name':'Mike','Last Name':'Psero',
                         'School':'Law'},
                       {'First Name':'Sally','Last Name':'Brooks',
                         'School':'Engineering'}])

#Indexación multiple usando on
pd.merge(staff_df, student_df, how='inner', on=['First Name','Last Name'])

  First Name Last Name            Role       School
0      Sally    Brooks  Course liasion  Engineering

In [26]:
#capture sirve para que deje pasar si no puede leer bien un csv
%%capture
df_01 =pd.read_csv('/content/drive/MyDrive/Colab Notebooks/DATASETS/distributed-data/001.csv',error_bad_lines=False)
df_02 =pd.read_csv('/content/drive/MyDrive/Colab Notebooks/DATASETS/distributed-data/002.csv',error_bad_lines=False)
df_03 =pd.read_csv('/content/drive/MyDrive/Colab Notebooks/DATASETS/distributed-data/003.csv',error_bad_lines=False)

In [27]:
print(df_01.head())

         Date  sulfate  nitrate  ID
0  2003-01-01      NaN      NaN   1
1  2003-01-02      NaN      NaN   1
2  2003-01-03      NaN      NaN   1
3  2003-01-04      NaN      NaN   1
4  2003-01-05      NaN      NaN   1

In [28]:
print(df_02.head())

         Date  sulfate  nitrate  ID
0  2001-01-01      NaN      NaN   2
1  2001-01-02      NaN      NaN   2
2  2001-01-03      NaN      NaN   2
3  2001-01-04      NaN      NaN   2
4  2001-01-05      NaN      NaN   2

In [29]:
frames=[df_01,df_02,df_03]
pd.concat(frames)

            Date  sulfate  nitrate  ID
0     2003-01-01      NaN      NaN   1
1     2003-01-02      NaN      NaN   1
2     2003-01-03      NaN      NaN   1
3     2003-01-04      NaN      NaN   1
4     2003-01-05      NaN      NaN   1
...          ...      ...      ...  ..
2186  2006-12-27      NaN      NaN   3
2187  2006-12-28      NaN      NaN   3
2188  2006-12-29      NaN      NaN   3
2189  2006-12-30      NaN      NaN   3
2190  2006-12-31      NaN      NaN   3

[7304 rows x 4 columns]

In [30]:
len(df_01)+len(df_02)+len(df_03)

7304

In [31]:
#pd.concat(frames, keys='ID')

              Date  sulfate  nitrate  ID
I 0     2003-01-01      NaN      NaN   1
  1     2003-01-02      NaN      NaN   1
  2     2003-01-03      NaN      NaN   1
  3     2003-01-04      NaN      NaN   1
  4     2003-01-05      NaN      NaN   1
...            ...      ...      ...  ..
D 3647  2010-12-27      NaN      NaN   2
  3648  2010-12-28      NaN      NaN   2
  3649  2010-12-29      NaN      NaN   2
  3650  2010-12-30      NaN      NaN   2
  3651  2010-12-31      NaN      NaN   2

[5113 rows x 4 columns]